In [1]:
from bs4 import BeautifulSoup
import pandas as pd
import requests

In [2]:
page = requests.get('https://sos.ga.gov/elections/election_results/2010_0810/0022002.htm')
soup = BeautifulSoup(page.text, 'html.parser')

In [3]:
table = soup.find_all("table")[2]

In [4]:
df = pd.read_html(str(table), flavor='bs4')

In [5]:
df = df[1]

In [6]:
df.shape

(162, 8)

In [7]:
df.head(5)

,0,1,2,3,4,5,6,7
0,NaN,NaN,"Buckner 38,599","Sinkfield 62,576","Totals 101,175",NaN,NaN,NaN
1,NaN,NaN,38.2%,61.8%,100.0%,NaN,NaN,NaN
2,County,PPR,NaN,NaN,NaN,NaN,NaN,NaN
3,APPLING,100%,130,78,208,NaN,NaN,NaN
4,ATKINSON,100%,42,21,63,NaN,NaN,NaN

In [8]:
df = df[3:]

In [9]:
df.head(5)

          0     1    2    3    4   5   6   7
3   APPLING  100%  130   78  208 NaN NaN NaN
4  ATKINSON  100%   42   21   63 NaN NaN NaN
5     BACON  100%   53   18   71 NaN NaN NaN
6     BAKER  100%   40   56   96 NaN NaN NaN
7   BALDWIN  100%  270  385  655 NaN NaN NaN

In [10]:
df = df[df.columns[[0,2,3]]]

In [11]:
df.head(5)

          0    2    3
3   APPLING  130   78
4  ATKINSON   42   21
5     BACON   53   18
6     BAKER   40   56
7   BALDWIN  270  385

In [12]:
df.columns = ['county', 'Georganna Sinkfield', 'Gail Buckner']

In [13]:
df.tail(5)

        county Georganna Sinkfield Gail Buckner
157  WHITFIELD                 218           73
158     WILCOX                  30           27
159     WILKES                 131           97
160  WILKINSON                 235          215
161      WORTH                 138          122

In [14]:
df = df.melt(id_vars=['county'])

In [15]:
df.columns = ['county', 'candidate', 'votes']

In [16]:
df.head()

     county            candidate votes
0   APPLING  Georganna Sinkfield   130
1  ATKINSON  Georganna Sinkfield    42
2     BACON  Georganna Sinkfield    53
3     BAKER  Georganna Sinkfield    40
4   BALDWIN  Georganna Sinkfield   270

In [17]:
df['votes'] = df['votes'].astype(int)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 318 entries, 0 to 317
Data columns (total 3 columns):
county       318 non-null object
candidate    318 non-null object
votes        318 non-null int64
dtypes: int64(1), object(2)
memory usage: 7.5+ KB

In [19]:
df['office'] = 'Secretary of State'

In [20]:
df['district'] = ''

In [21]:
df['party'] = 'Democratic'

In [22]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate            party
Gail Buckner         Democratic    62576
Georganna Sinkfield  Democratic    38599
Name: votes, dtype: int64

In [23]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

,county,office,district,party,candidate,votes
0,APPLING,Secretary of State,,Democratic,Georganna Sinkfield,130
1,ATKINSON,Secretary of State,,Democratic,Georganna Sinkfield,42
2,BACON,Secretary of State,,Democratic,Georganna Sinkfield,53
3,BAKER,Secretary of State,,Democratic,Georganna Sinkfield,40
4,BALDWIN,Secretary of State,,Democratic,Georganna Sinkfield,270

In [24]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')